Процедура ОбновитьИдИзменния(Вид) Экспорт
	УстановитьПривилегированныйРежим(Истина);  
	
	Зап = РегистрыСведений.ксОчередьОбменов.СоздатьМенеджерЗаписи();
	Зап.ВидОбъекта = нрег(вид);
	Зап.идОбмена = Новый УникальныйИдентификатор;
	Зап.ДатаИзменения = ТекущаяДата();
	Зап.Записать();
	
КонецПроцедуры    

Процедура ЗаписатьИдИзменения(СткИд) Экспорт
	Если СткИд =Неопределено Тогда Возврат; КонецесЛИ;
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Зап = РегистрыСведений.ксОчередьОбменов.СоздатьМенеджерЗаписи(); 
	ЗаполнитьЗначенияСвойств(Зап,СткИд);
	Зап.Записать();
	
КонецПроцедуры    

Функция СписокСтатусаИд() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ксОчередьОбменов.ВидОбъекта КАК ВидОбъекта,
	              |	ксОчередьОбменов.идОбмена КАК идОбмена,
	              |	ксОчередьОбменов.ДатаИзменения КАК ДатаИзменения
	              |ИЗ
	              |	РегистрСведений.ксОчередьОбменов КАК ксОчередьОбменов";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  


Функция ПроверитьСтатусыИд() Экспорт
	
	Стк = глЛокализацияУсловияСинхронизации.СткПолучитьСоединение();
	
	тблИд = глЗагрузитьОбъекты.сделатьЗапрос("SYNSTATUS",Неопределено);
	
	
	тбл = СписокСтатусаИд();
	
	масВид = новый Массив;
	Для каждого Стр из Тбл Цикл
		нс = тблИд.Найти(Стр.ВидОбъекта);
		Если нс = Неопределено Тогда Продолжить; КонецЕсли;
		Если нс.идОбмена <> стр.идОБмена Тогда
			масВид.добавить(стр.ВидОбъекта);
		КонецеслИ;
		
	Конеццикла; 
	
	Возврат масВид;
	
КонецФункции  

Функция ПолучитьИдОчереди(видОбк) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("видОбк",нрег(видОбк));
	Запрос.Текст ="ВЫБРАТЬ
	|	ксОчередьОбменов.ВидОбъекта КАК ВидОбъекта,
	|	ксОчередьОбменов.идОбмена КАК идОбмена,
	|	ксОчередьОбменов.ДатаИзменения КАК ДатаИзменения
	|ИЗ
	|	РегистрСведений.ксОчередьОбменов КАК ксОчередьОбменов
	|ГДЕ ВидОбъекта = &видОбк "; 
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Рез =  новый Структура("ВидОбъекта,идОбмена,ДатаИзменения");  
		ЗаполнитьЗначенияСвойств(Рез,Выб);
		Возврат Рез;
	ИНаче
		Возврат Неопределено;
	КонецЕслИ;
	
КонецФункции

