
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Стк = глЛокализацияУсловияСинхронизации.СткПолучитьСоединение();
	тблИд = глЗагрузитьОбъекты.сделатьЗапрос("SYNSTATUS",Неопределено);
	
	тбл = РегистрыСведений.ксОчередьОбменов.СписокСтатусаИд();
	
	Для каждого Стр из тблИд Цикл
		нс = тбл.Найти(Стр.ВидОбъекта);
	//	Если нс <> Неопределено Тогда Продолжить; КонецЕсли; 
		новстр = тблОчередь.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр,Стр);
		
	Конеццикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура тблОчередьВыборНаСервере(Стк)
	// Вставить содержимое обработчика.    
	РегистрыСведений.ксОчередьОбменов.ЗаписатьИдИзменения(Стк);	
	
КонецПроцедуры

&НаКлиенте
Процедура тблОчередьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	текСтр = Элемент.ТекущиеДанные;
	Если текСтр = Неопределено Тогда Возврат; КонецеслИ;
	
	Стк = новый Структура("ВидОбъекта,идОбмена"); 
	ЗаполнитьЗначенияСвойств(Стк,текСтр);
	тблОчередьВыборНаСервере(Стк);  
	ЭтаФорма.Закрыть();
КонецПроцедуры
