
&НаКлиенте
Процедура ДобавитьОБъектСинхронизации(Команда)
	// Вставить содержимое обработчика. 
	оо = Новый ОписаниеОповещения("ПослеВыбораОбъектаСинхронизации",ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.ксОчередьОбменов.Форма.Форма",,ЭтаФорма,ЭтаФорма,,,оо);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораОбъектаСинхронизации(Рез,доп) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизацию(Команда)
	ВыполнитьСинхронизациюНаСервере();
КонецПроцедуры   

&НаСервереБезКонтекста
Процедура ВыполнитьСинхронизациюНаСервере()
	глЗагрузитьОбъекты.ВыполнитьСинхронизациюИзОчереди();
КонецПроцедуры   


