Функция УсловияЗапросаВыборкиПоВидам(ВидОбк,Запрос) Экспорт
	
	Если НРЕГ(ВидОбк) = НРЕГ("СтатьиДвиженияДенежныхСредств")  Тогда
		
		Возврат "
		| и Док.ссылка в ИЕРАРХИИ(SELECT ссылка FROM Справочник.СтатьиДвиженияДенежныхСредств КАК С1 WHERE С1.наименование =""БДДС"" )
		| ";
		
	КонецЕсли;  
	
	Возврат "";
	
	
КонецФункции  


Функция СткПолучитьСоединение() Экспорт 
	
	Соединение = Новый HTTPСоединение(
									"virtual1c.aosilasibiri.ru", // сервер (хост)
									80, // порт, по умолчанию для http используется 80, для https 443
									"Serv", // пользователь для доступа к серверу (если он есть)
									"SERVgfhjkm", // пароль для доступа к серверу (если он есть)
									, // здесь указывается прокси, если он есть
									0, // таймаут в секундах, 0 или пусто - не устанавливать
									// защищенное соединение, если используется https
									);  
									
									Возврат Соединение;
									
	
КонецФункции


Процедура ксСинхроРегламентноеЗадание() Экспорт
	
	глЗагрузитьОбъекты.ВыполнитьСинхронизациюИзОчереди();
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка)=ЛОжь Тогда Возврат; Конецесли;
	
	рез = РегистрыСведений.ксРегИзмененийИзФормы.ПолучитьЛог(Форма.Объект.Ссылка);
	Если рез<>"" Тогда
		Форма.ТолькоПромотр = Истина;
	КонецеслИ;
	
КонецПроцедуры
